app/controllers/user_controller.rb

INSERT INTO `users` (`authorization_token`, `created_at`, `email`, `password`, `screen_name`, `updated_at`) VALUES (NULL, '2012-12-28 05:06:04', 's@dfdfd.com', '1234', 'asasacc', '2012-12-28 05:06:04')
---
  def register
  @title = "Register"
  if param_posted?(:user)
    @user = User.new(params[:user])
    if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`screen_name` = 'dhass' AND `users`.`password` = '1234' LIMIT 1
---
def login
@title = "Log in to RailsSpace"
#~ @@omniauth = request.env['omniauth.auth']
#~ authentication = User.find_by_provider_and_uid(@@omniauth[:provider], @@omniauth[:uid])
#~ if authentication
  #~ flash[:notice] = "User  logged in!"
#~ else
 if param_posted?(:user)
  @user = User.new(params[:user])
  user = User.find_by_screen_name_and_password(@user.screen_name,@user.password)